# Масивите са еднотипни и динамични - позволява се увеличаване и намаляване на размера им. Списъците не са еднотипни и не са динамични.
# Печатане на списък
l = [1, 2, 3, 4, 5] # списък с цели числа
print(l)
print()
print()


# Дефиниране на празен списък
l = []
for i in range(5):
    x = int(input(f"{i+1} : ")) 
    l.append(x) #  append добавя елемент в списъка
print(l)
print()
print()


# Дефиниране на списък с random числа
import random
l = []
for i in range(5):
    l.append(random.randint(-10, 10))
print(l)
print()
print()


# Сумиране на елементите в списък
sum = 0
for i in range(len(l)): # len(l) дава дължината на списъка
    sum += l[i]
print("Sum =", sum)
print()
# Подобрено
sum = 0
for x in l: # x приема стойностите на елементите в списъка. Цикъл for-each
    sum += x
print("Sum =", sum)
print()
print()

# print(sum())- сума на елементи
# print(min(l)) - минимален елемент на списъка 
# print(max(l)) - максимален елемент на списъка 


ll = input().split(", ") # въвеждане на елементи на списък от клавиатура, разделени със запетая и интервал
# split - разделя string на части, според зададения разделител
print(ll)
ll.append([1, 2, 3]) # добавяне на елемент в списъка,  който е друг списък, така става списък в списък
print(ll)


mm = [[1, 2, 3], 
      [11,12, 13], 
      [-1, -2, -3]] # дефиниране на множество от списъци
print(mm)
for x in mm: # x приема стойностите на елементите в списъка. Цикъл for-each
    print(x) # отпечатва всеки от списъците в нов ред
    for y in x: # x е списък, y приема стойностите на елементите в списъка x
        print(y, end=" ") # отпечатва елементите на всеки от списъците на един ред, разделени с интервал
    print() # нов ред след всеки от списъците

print()
print()


print(l) # отпечатва целия списък
print(l[1]) # отпечатва втория елемент от списъка
print(l[-1]) # отпечатва последния елемент от списъка
# print(l[10])  грешка - няма такъв елемент в списъка indexerror list index out of range
print(l[-5])

print(l)
# slice - част от списък. 
# обработване на slice
print(l[1:3]) # отпечатва елементите от 1 до 2 (3 не се включва)
print(l[1:]) # отпечатва елементите от 1 до края на списъка
print(l[:4]) # отпечатва елементите от началото на списъка до 3 (4 не се включва)
# slice с отрицателни индекси
print(l[-2:]) # отпечатва последните два елемента от списъка
print(l[:-3]) # отпечатва елементите от началото на списъка до -4 ( -3 не се включва)
print(l[-2:-4]) # отпечатва празен списък, защото -2 е по-голям от -4
print(l[-4:-2]) # отпечатва елементите от -4 до -3 (-2 не се включва)
print(l[:]) # отпечатва целия списък
print()
print()


# Промяна на елемент от списък
print(l)
l[1] = [11,12,13] # промяна на втория елемент от списъка с друг списък
print(l)

# вариант за добавяне на елементи в списък
l += [-1, -2, -3] # добавяне на елементи в списъка
print(l)

del l[0] # изтриване на първия елемент от списъка
print(l)
del l[2:4] # изтриване на елементите от 2 до 3 (4 не се включва)
print(l)
del l[:] # изтриване на всички елементи от списъка - тук се изтриват само елементите, но списъкът продължава да съществува
l.clear() # изтриване на всички елементи от списъка
print(l) 
del l # изтриване на списъка - елементите и самия списък
#print(l) грешка - l вече не съществува 
print()
print()

l = []
for i in range(5):
    l.append(random.randint(-10, 10))
    l += [1, 1] # добавяне на елементи в списъка
print(l)
print(l.count(1)) # брой на срещанията на елемента 1 в списъка
print(l.index(1)) # позиция на първото срещане на елемента 1 в списъка
print(l.index(1, l.index(1)+1)) # позиция на второто срещане на елемента 1 в списъка
l.insert(0, [1,1]) # добавяне на елемент на определена позиция в списъка. Първият аргумент е позицията, вторият елементът, който се добавя
print(l)
#l[3] += [2,2] TypeError: 'int' object is not iterable - грешка, защото l[3] е цяло число и не може да се добави списък към него  
#l[0] += 14  TypeError: 'list' object is not iterable - грешка, защото l[0] е списък и не може да се добави цяло число към него
l[0] += [14]
print(l)
print()

l.remove(1) # премахва първото срещане на елемента 1 от списъка
print(l)
# l.remove(11) - грешка, ако елемента го няма в списъка ValueError: list.remove(x): x not in list
if 1 in l: # проверка дали елемента го има в списъка
    l.remove(1) # премахва първото срещане на елемента 1 от списъка
print(l)
print()
print()

print(8>>1) # побитово изместване надясно
print(-8>>2) # побитово изместване надясно
print(2<<4) # побитово изместване наляво



 




