# 2 - Програма, в която е описана функция, която проверява дали едно цяло число е просто. Числото се предава като аргумент на функцията. Функцията връща като резултат true ако числото е просто и ако не е просто false. да се принтират всички числа в интервала от 2 до това просто число.
def Func(num):
    if num < 2:
        print("Невалидно число")
        return False
    else:
        lst = []
        for i in range(2, num + 1):
          lst.append(i)
          if num % i == 0 and i != num:
            return False  
         
    print(lst)
    return True  

Func(7)
