#  1 зад. - Напишете програма, която получава единствен низ, съдъжащ положителни и отрицателни числа, разделени с един интервал. Отпечатайте списък, съдържащ противоположната тойност на число
nums = input("Въведете числа: ").split()
lst = []
lst2 = []
for i in nums:
    i = int(i)
    lst.append(i)
    lst2.append(-i)
print(lst)
print(lst2)
print(lst.index(min(lst)))

#2 зад. - Напишете програма, която получава две числа (множител и брой). Трябва да се създаде списък с дължина дадения брой, който съдържа само цели числа, които са кратни на дадения множител. Числата трябва да са само положителни и трябва да са подредени във възходящ ред, започвайки от стойността на множителя. 
nums = input("Въведете числа: ").split()
num1 = int(nums[0])
num2 = int(nums[1])
lst = []
for i in range(1, num2 + 1):
    lst.append(num1 * i)

print(lst)    
    
# 3 зад - Напишете програма, която получава списък от цели числа(разделени с един интервал) и число n. Числото n представлява броя на числата, които трябва да се премахнат от списъка. Трябва да премахнете най- малките числа и след това да отпечатате всички числа, които остават в списъка, разделени със запетая и интервал.
lst = input("Въведете числа: ").split()
n = int(input("Въведете число: "))
lst2 = []
if (len(lst)) == 6:
    for i in lst:
      i = int(i)
      lst2.append(i)
    
    lst2.sort()
    print(lst2)
    
    for i in range(n):
       lst2.remove(min(lst2))
    print(lst2)
       

# 4 зад - Напишете програма, която получава списък от символи, разделени със ",". Трябва да създаде речник, в който всеки символ е ключ, а неговата ASKII стойност е стойност на елемента с този ключ.
symbols = input("Въведете символ: ").split(',')
lstSymbol = []
dictSymbol = {}
for ch in symbols:
    lstSymbol.append(ch)

for x in lstSymbol:
    dictSymbol[x] = ord(x)

print(dictSymbol)

# 5 зад. - Пишем програма, в която потребителят въвежда едно цяло число, на база това число се съставя списък. от 1 до числото. Въз основа на този списък се създава речник. Този речник елементите на списъка са ключове на елементите на речника, стойности на тези елементи в речника са елементите на списъка в обратен ред.
n = int(input("Въведете число: "))
lst = []
d = {}
for i in range(1,n+1):
    lst.append(i)

for x in range(len(lst)):
    d[lst[x]] = lst[n-x-1]
    
print(d)