#print ("Hello, World!")

# променлива - заделено място в паметта на компютъра, където се съхранява информация
# тип int - цяло число
# тип float - дробно число
# тип str - текст
# тип list - списък
# тип tuple - кортеж - подобен на списък, но не може да се променя след като е създаден (immutable)
# тип dict - речник - съхранява информация под формата на ключ-стойност (key-value pair) 

# + - събиране
# - - изваждане
# * - умножение
# / - деление
# // - цяло число от деление
# % - остатък от деление

#5/2 # 2.5
#5//2 # 2
#5%2 # 1 (остатък)

# string, tuple, list 
# + - конкатенация (събиране)
#'hello' + ' ' + 'world' # Отговор - 'hello world'
#[1,2] + [3,4] # [1,2,3,4]
# * - повторение
#'hi' * 3 # Отговор -'hihihi'
#[1,2] * 2 # [1,2,1,2]
# in - проверка за наличие 
#'h' in 'hello' # True
#'h' in 'Hello' # False

# input - въвеждане на информация от потребителя
# input('<съобщение, което подтиква потребителя какви данни трябва да въведе>')
# int(input()) - преобразува въведените данни от string в цяло число 
# float(input()) - преобразува въведените данни от string в дробно число 

#a = 10
#b = 5
#  Да се изпечата a =   b =   S = 
# 1. Начин - конкатенация
# print('a = '+ str(a) + ' b = ' + str(b) + ' S = ' + str(a*b))

# 2. Начин - чрез форматни спецификатори (%d - цяло число, %f - дробно число, %s - string)
#print('a = %d b = %d S = %d' % (a, b, a*b))
#print('a = %d b = %.2f S = %d' % (a, b, a*b)) - %.2f - означава, че ще се отпечатат 2 цифри след десетичната запетая

# 3. Начин - чрез метода format() - {0} е първият аргумент, {1} е вторият аргумент и т.н.
#print('a = {0} b = {1} S = {2}'.format(a, b, a*b))
#print('a = {0} b = {1:.2f} S = {2}'.format(a, b, a*b)) - .2f - означава, че ще се отпечатат 2 цифри след десетичната запетая

# 4. Начин - чрез f-string 
#print(f'a = {a} b = {b} S = {a*b}')

# 1 зад.
print("Hello Python") 
print()

# 2 зад.
print('  * ' + '      *')
print(' * '' *'+ '   *'  '   *')   
print('  *   '+'*' + '    *')
print('   *' + '      *')
print('    *' + '   *')
print('     *' + ' *')
print('      *')
print()

# 3 зад.
name = input("Enter name = ")
birthYear = int(input("Enter birth year = "))
print(f'Hello, I am {name} and i am {2025 - birthYear} years old.')
print()

# 4 зад.
a = float(input("Enter a = "))
b = float(input("Enter b = "))
h = float(input("Enter h = "))
S = ((a + b) / 2) * h
print(f'Страната A е = {a},Страната B е = {b},Височината е = {h},Лицето на трапеца с височина {h} = {S:.3f} см²')
print()

# 5 зад.
countHour = int(input("Въведете броя на оотработените часове = "))
moneyForHour = float(input("Въведете каква сума получава за 1 час = "))
salary = countHour * moneyForHour
print(f'Брутната заплата според отработените часове е {salary:.2f}')
print()

#6 зад.
a = int(input("Enter a = "))
num1 = a // 1000
num2 =  (a // 100) % 10 # взима второто число
num3 = (a // 10) % 10 # взима третото число
num4 = a % 10 # взима четвъртото число
sum = num1 + num2 + num3 + num4
print(f'След като сменим първото число с последното, числото ще бъде {num4}{num2}{num3}{num1}')
print (f'Сумата на цифрите е {sum}')
print()

